In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
raw_data={'first_name': ['Jasom', 'Molly', 'Tina', 'Jake', 'Amy'],
         'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
         'age': [42,52,35,24,73],
         'city':['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jasom    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   35          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [3]:
DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   35          Miami
3   24        Douglas
4   73         Boston

In [5]:

DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jasom    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   35          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [6]:
df= DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name

0    Jasom
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [7]:
df['first_name']

0    Jasom
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [8]:
df.first_name

0    Jasom
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [9]:
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [11]:
df["age"].loc[1:]

1    52
2    35
3    24
4    73
Name: age, dtype: int64